src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияПриПолученииДанныхОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакЗагружать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийПриПолученииДанныхОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияПоискаПоКлючам</Name>
					<Comment>Может принимать значения "Оптимально" или "Стандарт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияУстановленыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтратегииПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыДействийПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПриПолученииДанныхОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПослеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Помощником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУстанавливать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена/Forms/НастройкаДействий/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ИнициализироватьФорму();
	
	ОбработатьПереданныеПараметры(Параметры, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если НеЗагружатьНастройкиОтбораИзНастроек Тогда
		
		НастройкиКУдалению = Новый Массив;
		ИменаРеквизитовОтбора = ИменаРеквизитовОтбора();
		
		Для Каждого КлючИЗначение Из Настройки Цикл
			
			Если ИменаРеквизитовОтбора.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
				
				НастройкиКУдалению.Добавить(КлючИЗначение.Ключ);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого НастройкаКУдалению Из НастройкиКУдалению Цикл
			
			Настройки.Удалить(НастройкаКУдалению)
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОтборПоТипамНастройки = Настройки.Получить("ОтборПоТипам"); 
	
	Если ОтборПоТипамНастройки <> Неопределено Тогда
		
		Настройки.Удалить("ОтборПоТипам");
		
		Для Каждого СтрокаОтбора Из ОтборПоТипам Цикл
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("ТипМетаданных", СтрокаОтбора.ТипМетаданных);
			
			НайденныеСтроки = ОтборПоТипамНастройки.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаОтбора.Выбран = НайденныеСтроки[0].Выбран;
				
			Иначе
				
				СтрокаОтбора.Выбран = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияУстанавливатьСоответствияГиперссылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВариантОтображенияНастройки = "УстанавливатьСоответствия";

	УправлениеСтраницамиРекомендаций(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакЗагружатьГиперссылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВариантОтображенияНастройки = "КакЗагружать";

	УправлениеСтраницамиРекомендаций(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействияПриПолучении

&НаКлиенте
Процедура ДействияПриПолученииУстанавливатьСоответствияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Возврат;

КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииДляСуществующихОбъектовОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Возврат;

КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДействияПриПолученииИндексКартинкиОбъектМетаданных"
		Или Поле.Имя = "ДействияПриПолученииСиноним"
		Или Поле.Имя = "ДействияПриПолученииЗначенияУстановленыАвтоматически"
		Или Поле.Имя = "ДействияПриПолученииБезСоответствияВИБ" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФормуИзмененияЗаписи();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииКомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуИзмененияЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииДляЗагружатьПриИзменении(Элемент)
	
	ПриИзмененииНастройкиПолученияВТаблице();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииУстанавливатьСоответствияПриИзменении(Элемент)
	
	ПриИзмененииНастройкиПолученияВТаблице();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииДляСуществующихОбъектовПриИзменении(Элемент)
	
	ПриИзмененииНастройкиПолученияВТаблице();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииКомментарийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДействияПриПолучении.ТекущиеДанные;
	
	ТекущиеДанные.НаличиеКомментария = НЕ ПустаяСтрока(ТекущиеДанные.Комментарий);
	
	СтруктураДействий = НовыйСтруктураДействий(УзелПланаОбмена);
	
	ЗаполнитьЗначенияСвойств(СтруктураДействий, ТекущиеДанные);
	
	ОбновитьЗаписиНаСервере(СтруктураДействий);
	Оповестить("Запись_ДействияПриПолученииДанныхОбмена");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборПоТипам

&НаКлиенте
Процедура ОтборПоТипамВыбранПриИзменении(Элемент)
	
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ИзменениеСтрок

&НаКлиенте
Процедура ПодтвердитьНастройкиЗагрузки(Команда)
	
	СтрокиДействия = Новый Массив;
	
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ДействияПриПолучении.ВыделенныеСтроки Цикл
		
		Действие = НовыйСтруктураДействий(УзелПланаОбмена);
		ДанныеСтроки = ДействияПриПолучении.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Не ДанныеСтроки.ЗначенияУстановленыАвтоматически Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Действие, ДанныеСтроки);
		Действие.ЗначенияУстановленыАвтоматически = Ложь;
		ОбновитьСтрокуДействияПриПолученииНаКлиенте(ИдентификаторВыделеннойСтроки, Действие);
		
		СтрокиДействия.Добавить(Действие);
		
	КонецЦикла;
	
	Если СтрокиДействия.Количество() > 0 Тогда
		ОбновитьЗаписиНаСервере(СтрокиДействия);
		Оповестить("Запись_ДействияПриПолученииДанныхОбмена");
	КонецЕсли;
	
	ОпределитьДоступностьКомандыПодтверждениеЗагрузки(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ИзменениеСтрок

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ВыделенныеСтроки = Элементы.ДействияПриПолучении.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"), 5);
		Возврат;
	КонецЕсли;
		
	Если НастройкиГрупповогоИзменения.Количество() > 0 Тогда
		
		ОповещениеОВыбореРанееИспользовавшегосяВарианта = Новый ОписаниеОповещения("ПослеВыбораВариантаГрупповогоИзмененияИзМеню", ЭтотОбъект);
		
		РанееИспользовавшиесяВариантыГрупповогоИзменения = РанееИспользовавшиесяВариантыГрупповогоИзменения();
		ИспользовавшиесяВариантыМеню = РанееИспользовавшиесяВариантыГрупповогоИзменения.Скопировать();
		ДобавитьВариантГрупповогоИзмененияНовый(ИспользовавшиесяВариантыМеню);
		
		ПоказатьВыборИзМеню(ОповещениеОВыбореРанееИспользовавшегосяВарианта,
		                    ИспользовавшиесяВариантыМеню,
		                    Элементы.ИзменитьВыделенные);
		
	Иначе
		
		ОткрытьФормуГрупповогоИзменения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗапись(Команда)
	
	ОткрытьФормуИзмененияЗаписи()

КонецПроцедуры

#КонецОбласти

#Область ОтборЗагружать

&НаКлиенте
Процедура ЗагружатьНеВажно(Команда)
	
	ОтборЗагружать = 0;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьЗагружать(Команда)
	
	ОтборЗагружать = 1;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьНеЗагружать(Команда)
	
	ОтборЗагружать = 2;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборКакЗагружать

&НаКлиенте
Процедура КакЗагружатьНеВажно(Команда)
	
	ОтборКакЗагружать = 0;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КакЗагружатьАвтоматически(Команда)
	
	ОтборКакЗагружать = 1;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КакЗагружатьПодтверждать(Команда)
	
	ОтборКакЗагружать = 2;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область УстанавливатьСоответствие

&НаКлиенте
Процедура УстанавливатьСоответствияНеВажно(Команда)
	
	ОтборУстанавливатьСоответствия = 0;
	УстановитьОтборыВСписке(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьСоответствияПомощник(Команда)
	
	ОтборУстанавливатьСоответствия = 1;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьСоответствияАвтоматически(Команда)
	
	ОтборУстанавливатьСоответствия = 2;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НеУстанавливатьСоответствия(Команда)
	
	ОтборУстанавливатьСоответствия = 3;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборЕстьСоответствие

&НаКлиенте
Процедура ЕстьСоответствиеНеВажно(Команда)
	
	ОтборУстановленоСоответствие = 0;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСоответствиеВсе(Команда)
	
	ОтборУстановленоСоответствие = 3;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСоответствиеНеВсе(Команда)
	
	ОтборУстановленоСоответствие = 2;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСоответствиеНиОдномуОбъекту(Команда)
	
	ОтборУстановленоСоответствие = 1;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры 

#КонецОбласти

#Область ОтборЗначенияУстановленыАвтоматически

&НаКлиенте
Процедура ЗначенияУстановленыАвтоматическиНеВажно(Команда)
	
	ОтборТребуетсяПодтверждение = 0;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияУстановленыАвтоматическиЛожь(Команда)
	
	ОтборТребуетсяПодтверждение = 2;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияУстановленыАвтоматическиИстина(Команда)
	
	ОтборТребуетсяПодтверждение = 1;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборНаличиеКомментария

&НаКлиенте
Процедура НаличиеКомментарияНеВажно(Команда)
	
	ОтборНаличиеКомментария = 0;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаличиеКомментарияЗаполнен(Команда)
	
	ОтборНаличиеКомментария = 1;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаличиеКомментарияПустой(Команда)
	
	ОтборНаличиеКомментария = 2;
	УстановитьОтборыВСписке(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервереБезКонтекста
Функция ПредставлениеСпискаМаксимальнойДлины(СущностьСтрокой, СтрокиСписка, МаксимальнаяДлинаСтроки)
	
	СкрытыхОтборов = 0;
	ТекстВарианта = СтрСоединить(СтрокиСписка, ", ");
	
	Пока СтрДлина(ТекстВарианта) >= МаксимальнаяДлинаСтроки Цикл
		
		КоличествоОтборов = СтрокиСписка.Количество();
		СкрытыхОтборов    = СкрытыхОтборов + 1; 
		
		СтрокиСписка.Удалить(КоличествоОтборов-1);
		
		СклонениеОтборовПоЧислу = ПолучитьСклоненияСтрокиПоЧислу(СущностьСтрокой,СкрытыхОтборов,,"L=ru_RU; ЧС=Количественное","ПД=Винительный; ПЧ=Число");
		ТекстВарианта = СтрСоединить(СтрокиСписка, ", ") + " " + СтрШаблон(НСтр("ru = 'и еще %1'"), СклонениеОтборовПоЧислу[0]);
		
	КонецЦикла;
	
	Возврат ТекстВарианта;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьДоступностьКомандыПодтверждениеЗагрузки(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ЗначенияУстановленыАвтоматически", Истина);
	
	ЕстьЧтоПодтверждать = Форма.ДействияПриПолучении.НайтиСтроки(ПараметрыПоиска).Количество() > 0;
	
	ЭлементыФормы.ПодтвердитьНастройкиЗагрузки.Видимость                                    = ЕстьЧтоПодтверждать;
	ЭлементыФормы.ДействияПриПолученииКонтекстноеМенюПодтвердитьНастройкиЗагрузки.Видимость = ЕстьЧтоПодтверждать;
	ЭлементыФормы.ДействияПриПолученииЗначенияУстановленыАвтоматически.Видимость            = ЕстьЧтоПодтверждать;

КонецПроцедуры

&НаСервере
Функция ИндексыКартинокТиповОбъектовМетаданных(ИмяТипаМетаданных)
	
	Если ИмяТипаМетаданных = "Константы" Тогда
		
		Возврат 1;
		
	ИначеЕсли ИмяТипаМетаданных = "Справочники" Тогда
		
		Возврат 3;
	
	ИначеЕсли ИмяТипаМетаданных = "Документы" Тогда
		
		Возврат 7;

	ИначеЕсли ИмяТипаМетаданных = "ПланыВидовХарактеристик" Тогда
		
		Возврат 9;
		
	ИначеЕсли ИмяТипаМетаданных = "РегистрыСведений" Тогда
		
		Возврат 15;

	ИначеЕсли ИмяТипаМетаданных = "РегистрыНакопления" Тогда
		
		Возврат 17;

	ИначеЕсли ИмяТипаМетаданных = "РегистрыБухгалтерии" Тогда
		
		Возврат 19;
		
	ИначеЕсли ИмяТипаМетаданных = "РегистрыРасчета" Тогда
		
		Возврат 21;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ИзменениеЗаписи

&НаКлиенте
Процедура ОткрытьФормуИзмененияЗаписи()

	ТекущиеДанные = Элементы.ДействияПриПолучении.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"), 5);
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПредставлениеТипаМетаданных",    ТекущиеДанные.Синоним);
	ПараметрыОткрытия.Вставить("ИмяТипаМетаданных",              ТекущиеДанные.ИмяТипаМетаданных);
	ПараметрыОткрытия.Вставить("Загружать",                      ТекущиеДанные.Загружать);
	ПараметрыОткрытия.Вставить("УстанавливатьСоответствия",      ТекущиеДанные.УстанавливатьСоответствия);
	ПараметрыОткрытия.Вставить("КакЗагружать",                   ТекущиеДанные.КакЗагружать);
	ПараметрыОткрытия.Вставить("Комментарий",                    ТекущиеДанные.Комментарий);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторТекущейСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	ДополнительныеПараметры.Вставить("ОбъектМетаданных",           ТекущиеДанные.ОбъектМетаданных);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыИзмененияЗаписи", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("РегистрСведений.ДействияПриПолученииДанныхОбмена.Форма.ИзменениеЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,,
	              ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияФормыИзмененияЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		СтруктураДействий = НовыйСтруктураДействий(УзелПланаОбмена);
		ЗаполнитьЗначенияСвойств(СтруктураДействий, Результат);
		
		СтруктураДействий.ОбъектМетаданных                 = ДополнительныеПараметры.ОбъектМетаданных;
		СтруктураДействий.ЗначенияУстановленыАвтоматически = Ложь;
		
		ОбновитьСтрокуДействияПриПолученииНаКлиенте(ДополнительныеПараметры.ИдентификаторТекущейСтроки, СтруктураДействий);
		
		ОбновитьЗаписиНаСервере(СтруктураДействий);
		Оповестить("Запись_ДействияПриПолученииДанныхОбмена");
		
		ОпределитьДоступностьКомандыПодтверждениеЗагрузки(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуДействияПриПолученииНаКлиенте(ИдентификаторСтроки, НовыеДействия)

	СтрокаТаблицыДействий = ДействияПриПолучении.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьЗначенияСвойств(СтрокаТаблицыДействий, НовыеДействия);

КонецПроцедуры

#КонецОбласти

#Область Рекомендации

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеСтраницамиРекомендаций(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	Если Форма.ВариантОтображенияНастройки = "УстанавливатьСоответствия" Тогда
		
		ЭлементыФормы.СтраницыУстанавливатьСоответствияЗаголовок.ТекущаяСтраница = ЭлементыФормы.СтраницаУстанавливатьСоответствияЗаголовокНетГиперссылки;
		ЭлементыФормы.СтраницыКакЗагружатьЗаголовок.ТекущаяСтраница = ЭлементыФормы.СтраницаКакЗагружатьЗаголовокГиперссылка;
		
		ЭлементыФормы.СтраницыСодержимоеДляОбъектов.ТекущаяСтраница = ЭлементыФормы.СтраницаСодержимоеРекомендацииУстанавливатьСоответствия;
		
	Иначе
		
		ЭлементыФормы.СтраницыУстанавливатьСоответствияЗаголовок.ТекущаяСтраница = ЭлементыФормы.СтраницаУстанавливатьСоответствияЗаголовокГиперссылка;
		ЭлементыФормы.СтраницыКакЗагружатьЗаголовок.ТекущаяСтраница = ЭлементыФормы.СтраницаКакЗагружатьЗаголовокНетГиперссылки;
		
		ЭлементыФормы.СтраницыСодержимоеДляОбъектов.ТекущаяСтраница = ЭлементыФормы.СтраницаСодержимоеРекомендацииКакЗагружать;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРекомендацииПоНастройке()

	МакетРекомендации = РегистрыСведений.ДействияПриПолученииДанныхОбмена.ПолучитьМакет("РекомендацииПоНастройке");

	ОбластьРекомендации = МакетРекомендации.ПолучитьОбласть("РекомендацииДляНовых");
	РекомендацииУстанавливатьСоответствия.Вывести(ОбластьРекомендации);
	
	ОбластьРекомендации = МакетРекомендации.ПолучитьОбласть("РекомендацииДляСуществующих");
	РекомендацииДляСуществующих.Вывести(ОбластьРекомендации);
	
	УправлениеСтраницамиРекомендаций(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовкиПодменю(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	Если Форма.ОтборЗагружать = 0 Тогда
		
		ЗаголовокЗагружать = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборЗагружать = 1 Тогда
		
		ЗаголовокЗагружать = НСтр("ru = 'Загружаются'");
		
	ИначеЕсли Форма.ОтборЗагружать = 2 Тогда
		
		ЗаголовокЗагружать = НСтр("ru = 'Не загружаются'");
		
	КонецЕсли;
	
	Если Форма.ОтборКакЗагружать = 0 Тогда
		
		ЗаголовокКакЗагружать = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборКакЗагружать = 1 Тогда
		
		ЗаголовокКакЗагружать = НСтр("ru = 'Автоматически'");
		
	ИначеЕсли Форма.ОтборКакЗагружать = 2 Тогда
		
		ЗаголовокКакЗагружать = НСтр("ru = 'После подтверждения'");
		
	КонецЕсли;
	
	Если Форма.ОтборУстанавливатьСоответствия = 0 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 1 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Помощником (по любым полям)'");
		
	ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 2 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Автоматически (по ключевым полям)'");
		
	ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 3 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Не устанавливать (создавать новые)'");
		
	КонецЕсли;
	
	Если Форма.ОтборУстанавливатьСоответствия = 0 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 1 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Помощником (по любым полям)'");
		
	ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 2 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Автоматически (по ключевым полям)'");
		
	ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 3 Тогда
		
		ДекорацияЗаголовокУстанавливатьСоответствия = НСтр("ru = 'Не устанавливать (создавать новые)'");
		
	КонецЕсли;
	
	Если Форма.ОтборУстановленоСоответствие = 0 Тогда
		
		ЗаголовокУстановленоСоответствие = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборУстановленоСоответствие = 3 Тогда
		
		ЗаголовокУстановленоСоответствие = НСтр("ru = 'Всем объектам'");
		
	ИначеЕсли Форма.ОтборУстановленоСоответствие = 2 Тогда
		
		ЗаголовокУстановленоСоответствие = НСтр("ru = 'Части объектов'");
		
	ИначеЕсли Форма.ОтборУстановленоСоответствие = 1 Тогда
		
		ЗаголовокУстановленоСоответствие = НСтр("ru = 'Ни одному объекту'");
		
	КонецЕсли; 
	
	Если Форма.ОтборНаличиеКомментария = 0 Тогда
		
		ЗаголовокНаличиеКомментария = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборНаличиеКомментария = 1 Тогда
		
		ЗаголовокНаличиеКомментария = НСтр("ru = 'Заполнен'");
		
	ИначеЕсли Форма.ОтборНаличиеКомментария = 2 Тогда
		
		ЗаголовокНаличиеКомментария = НСтр("ru = 'Пустой'");
		
	КонецЕсли;
	
	Если Форма.ОтборТребуетсяПодтверждение = 0 Тогда
		
		ЗаголовокТребуетПодтверждения = НСтр("ru = 'Не важно'");
		
	ИначеЕсли Форма.ОтборТребуетсяПодтверждение = 1 Тогда
		
		ЗаголовокТребуетПодтверждения = НСтр("ru = 'Да'");
		
	ИначеЕсли Форма.ОтборТребуетсяПодтверждение = 2 Тогда
		
		ЗаголовокТребуетПодтверждения = НСтр("ru = 'Нет'");
		
	КонецЕсли;
	
	ЭлементыФормы.ПодменюОтборЗагружать.Заголовок                   = ЗаголовокЗагружать;
	ЭлементыФормы.ПодменюУстанавливатьСоответствия.Заголовок        = ДекорацияЗаголовокУстанавливатьСоответствия;
	ЭлементыФормы.ПодменюКакЗагружать.Заголовок                     = ЗаголовокКакЗагружать;
	ЭлементыФормы.ПодменюУстановленоСоответствие.Заголовок          = ЗаголовокУстановленоСоответствие;
	ЭлементыФормы.ПодменюНаличиеКомментария.Заголовок               = ЗаголовокНаличиеКомментария;
	ЭлементыФормы.ПодменюЗначенияУстановленыАвтоматически.Заголовок = ЗаголовокТребуетПодтверждения;
	
	ПерерисоватьФлажкиВПодменюОтбора(Форма, Форма.ОтборЗагружать,                 ЭлементыФормы.ПодменюОтборЗагружать);
	ПерерисоватьФлажкиВПодменюОтбора(Форма, Форма.ОтборУстанавливатьСоответствия, ЭлементыФормы.ПодменюУстанавливатьСоответствия);
	ПерерисоватьФлажкиВПодменюОтбора(Форма, Форма.ОтборКакЗагружать,              ЭлементыФормы.ПодменюКакЗагружать);
	ПерерисоватьФлажкиВПодменюОтбора(Форма, Форма.ОтборУстановленоСоответствие,   ЭлементыФормы.ПодменюУстановленоСоответствие);
	ПерерисоватьФлажкиВПодменюОтбора(Форма, Форма.ОтборНаличиеКомментария,        ЭлементыФормы.ПодменюНаличиеКомментария);
	ПерерисоватьФлажкиВПодменюОтбора(Форма, Форма.ОтборТребуетсяПодтверждение,    ЭлементыФормы.ПодменюЗначенияУстановленыАвтоматически);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ПерерисоватьФлажкиВПодменюОтбора(Форма, ТекущееЗначение, ЭлементПодменю)
	
	ПорядковыйНомер = 0;
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементПодменю.ПодчиненныеЭлементы Цикл
		
		ПодчиненныйЭлемент.Пометка = (ПорядковыйНомер = ТекущееЗначение);
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыбранныеТипы(ОтборПоТипам, ВозвращатьПредставления = Ложь)
	
	ВыбранныеТипы = Новый Соответствие;
	Для Каждого СтрокаДоступныеТипы Из ОтборПоТипам Цикл
		
		Если СтрокаДоступныеТипы.Выбран Тогда
			
			ВыбранныеТипы.Вставить(?(ВозвращатьПредставления, СтрокаДоступныеТипы.ПредставлениеТипаМетаданных, СтрокаДоступныеТипы.ТипМетаданных),
			                       Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыбранныеТипы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеОтбора(Форма)

	УстановленныеОтборы = Новый Массив;
	
	Если Форма.ОтборЗагружать = 1 Тогда
		
		УстановленныеОтборы.Добавить(НСтр("ru = 'загружать'"));
		
	ИначеЕсли Форма.ОтборЗагружать = 2 Тогда
		
		УстановленныеОтборы.Добавить(НСтр("ru = 'не загружать'"));
		
	КонецЕсли;
	
	Если Форма.ОтборКакЗагружать <> 0 Тогда
		
		СтрокаДляСуществующих = СтрШаблон(НСтр("ru = 'как загружать - ""%1""'"),
		                           ?(Форма.ОтборКакЗагружать = 1, НСтр("ru = 'автоматически'"), НСтр("ru = 'После подтверждения'")));
		
		УстановленныеОтборы.Добавить(СтрокаДляСуществующих);
		
	КонецЕсли;
	
	Если Форма.ОтборУстанавливатьСоответствия <> 0 Тогда
		
		Если Форма.ОтборУстанавливатьСоответствия = 1 Тогда
			
			СтрокаУстанавливатьСоответствия = НСтр("ru = 'уст. соотв. - помощником'");
			
		ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 2 Тогда
			
			СтрокаУстанавливатьСоответствия = НСтр("ru = 'уст. соотв. - автоматически'")
			
		ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 3 Тогда
			
			СтрокаУстанавливатьСоответствия = НСтр("ru = 'не уст. соотв.'")
			
		КонецЕсли;
		
		УстановленныеОтборы.Добавить(СтрокаУстанавливатьСоответствия);
		
	КонецЕсли;
	
	Если Форма.ОтборУстановленоСоответствие <> 0 Тогда
		
		Если Форма.ОтборУстановленоСоответствие = 3 Тогда
			
			СтрокаДляСоответствий = СтрШаблон(НСтр("ru = 'соответствуют все'"));
			
		ИначеЕсли Форма.ОтборУстановленоСоответствие = 2 Тогда
			
			СтрокаДляСоответствий = СтрШаблон(НСтр("ru = 'часть соответствуют'"));
			
		Иначе
			
			СтрокаДляСоответствий = СтрШаблон(НСтр("ru = 'соответствий нет'"));
			
		КонецЕсли;
		
		УстановленныеОтборы.Добавить(СтрокаДляСоответствий);
		
	КонецЕсли;
	
	Если Форма.ОтборНаличиеКомментария <> 0 Тогда
		
		СтрокаДляКомментария = СтрШаблон(НСтр("ru = 'комментарий - ""%1""'"),
		                           ?(Форма.ОтборНаличиеКомментария = 1, НСтр("ru = 'заполнен'"), НСтр("ru = 'пустой'")));
		
		УстановленныеОтборы.Добавить(СтрокаДляКомментария);
		
	КонецЕсли;
	
	Если Форма.ОтборТребуетсяПодтверждение = 1 Тогда
		
		УстановленныеОтборы.Добавить(НСтр("ru = 'требуют подтверждения'"));
		
	ИначеЕсли Форма.ОтборТребуетсяПодтверждение = 2 Тогда
		
		УстановленныеОтборы.Добавить(НСтр("ru = 'не требует подтверждения'"));
		
	КонецЕсли;
	
	ВыбранныеТипы = ВыбранныеТипы(Форма.ОтборПоТипам, Истина);
	
	Если ВыбранныеТипы.Количество() = 0 Тогда
		
		Если Форма.ОтборПоТипам.Количество() <> 0 Тогда
			
			СтрокаТипы = НСтр("ru = 'не выбран тип'");
			
			УстановленныеОтборы.Добавить(СтрокаТипы);
			
		КонецЕсли;
		
	ИначеЕсли ВыбранныеТипы.Количество() <> Форма.ОтборПоТипам.Количество() Тогда
		
		СтрокаТипы = НСтр("ru = 'типы:'") + " ";
		
		НужнаЗапятая = Ложь;
		
		Для Каждого КлючИЗначение Из ВыбранныеТипы Цикл
			
			СтрокаТипы = СтрокаТипы + ?(НужнаЗапятая, ", ", "") + НРег(КлючИЗначение.Ключ);
			
			НужнаЗапятая = Истина;
			
		КонецЦикла;
		
		УстановленныеОтборы.Добавить(СтрокаТипы);
		
	КонецЕсли;
	
	Если УстановленныеОтборы.Количество() = 0 Тогда
		
		СтрокаОтбор = НСтр("ru = 'Отбор не установлен'");
		
	Иначе
		
		СтрокаОтбор = НСтр("ru = 'Отбор:'") + " " + ПредставлениеСпискаМаксимальнойДлины("отбор", УстановленныеОтборы, 60); 
		
	КонецЕсли;
	
	Форма.Элементы.ГруппаОтборПоТипам.Заголовок = СтрокаОтбор;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыВСписке(Форма)
	
	НастройкаОтбора = Новый Структура;
	
	Если Форма.ОтборЗагружать = 2  Тогда
		
		НастройкаОтбора.Вставить("Загружать", Ложь);
		
	ИначеЕсли Форма.ОтборЗагружать = 1
		Или Форма.ОтборЗагружать = 0 Тогда
		
		Если Форма.ОтборЗагружать = 1 Тогда
		
			НастройкаОтбора.Вставить("Загружать", Истина);
		
		КонецЕсли;
		
		Если Форма.ОтборКакЗагружать = 1 Тогда
			
			НастройкаОтбора.Вставить("КакЗагружать", 
			                         ПредопределенноеЗначение("Перечисление.ВариантыДействийПриПолученииДанныхОбмена.Автоматически"));
			
		ИначеЕсли Форма.ОтборКакЗагружать = 2 Тогда
			
			НастройкаОтбора.Вставить("КакЗагружать", 
			                          ПредопределенноеЗначение("Перечисление.ВариантыДействийПриПолученииДанныхОбмена.ПослеПодтверждения"));
			
		КонецЕсли;
		
		Если Форма.ОтборУстанавливатьСоответствия = 1 Тогда
			
			НастройкаОтбора.Вставить("УстанавливатьСоответствия", 
			                         ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником"));
			
		ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 2 Тогда
			
			НастройкаОтбора.Вставить("УстанавливатьСоответствия", 
			                         ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Автоматически")); 
			
		ИначеЕсли Форма.ОтборУстанавливатьСоответствия = 3 Тогда
			
			НастройкаОтбора.Вставить("УстанавливатьСоответствия", 
			                         ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.НеУстанавливать"));
			
		КонецЕсли;
		
		Если Форма.ОтборУстановленоСоответствие = 1 Тогда
			
			НастройкаОтбора.Вставить("ПроцентСоответствияОтбор", "Процент0");
			
		ИначеЕсли Форма.ОтборУстановленоСоответствие = 2 Тогда
			
			НастройкаОтбора.Вставить("ПроцентСоответствияОтбор", "ПроцентДо100");
			
		ИначеЕсли Форма.ОтборУстановленоСоответствие = 3 Тогда
			
			НастройкаОтбора.Вставить("ПроцентСоответствияОтбор", "Процент100");
			
		КонецЕсли;
		
		Если Форма.ОтборНаличиеКомментария = 1 Тогда
			
			НастройкаОтбора.Вставить("НаличиеКомментария", Истина);
			
		ИначеЕсли Форма.ОтборНаличиеКомментария = 2 Тогда
			
			НастройкаОтбора.Вставить("НаличиеКомментария", Ложь);
			
		КонецЕсли;
		
		Если Форма.ОтборТребуетсяПодтверждение = 1 Тогда
			
			НастройкаОтбора.Вставить("ЗначенияУстановленыАвтоматически", Истина);
			
		ИначеЕсли Форма.ОтборТребуетсяПодтверждение = 2 Тогда
			
			НастройкаОтбора.Вставить("ЗначенияУстановленыАвтоматически", Ложь);
			
		КонецЕсли;
		
		ВыбранныеТипы = ВыбранныеТипы(Форма.ОтборПоТипам);
		
		Для Каждого СтрокаНастройкаДействий Из Форма.ДействияПриПолучении Цикл
			
			СтрокаНастройкаДействий.СоответствуетОтборуПоТипу = ?(ВыбранныеТипы.Получить(СтрокаНастройкаДействий.ИмяТипаМетаданных) = Неопределено, Ложь, Истина);
			
		КонецЦикла;
		
		НастройкаОтбора.Вставить("СоответствуетОтборуПоТипу", Истина);
		
	КонецЕсли;
	
	Если НастройкаОтбора.Количество() = 0 Тогда
		Форма.Элементы.ДействияПриПолучении.ОтборСтрок = Неопределено;
	Иначе
		Форма.Элементы.ДействияПриПолучении.ОтборСтрок = Новый ФиксированнаяСтруктура(НастройкаОтбора);
	КонецЕсли;
	
	СформироватьПредставлениеОтбора(Форма);
	ОбновитьЗаголовкиПодменю(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаРеквизитовОтбора()

	ИменаРеквизитовОтбора = Новый Массив;
	ИменаРеквизитовОтбора.Добавить("ОтборЗагружать");
	ИменаРеквизитовОтбора.Добавить("ОтборКакЗагружать");
	ИменаРеквизитовОтбора.Добавить("ОтборНаличиеКомментария");
	ИменаРеквизитовОтбора.Добавить("ОтборПоТипам");
	ИменаРеквизитовОтбора.Добавить("ОтборТребуетсяПодтверждение");
	ИменаРеквизитовОтбора.Добавить("ОтборУстанавливатьСоответствия");
	ИменаРеквизитовОтбора.Добавить("ОтборУстановленоСоответствие");
	
	Возврат ИменаРеквизитовОтбора;

КонецФункции

#КонецОбласти

#Область ИнициализацияФормы

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
#Область ПредставлениеОбъектаЦветЕслиНеЗагружать

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДействияПриПолученииСиноним.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДействияПриПолучении.Загружать");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветаСтиля.ЦветТекстаНедоступногоЭлемента);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
#КонецОбласти

#Область КакЗагружатьУстанавливатьСоответствияЕслиНеЗагружать
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДействияПриПолученииУстанавливатьСоответствия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДействияПриПолученииКакЗагружать.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДействияПриПолучении.Загружать");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветаСтиля.ЦветТекстаНедоступногоЭлемента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",          НСтр("ru = 'Не применимо'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
#КонецОбласти

#Область ПроцентСоответствияВЗависимости
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДействияПриПолученииБезСоответствияВИБ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДействияПриПолучении.ПроцентСоответствия");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 90;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НастройкаОтбораОбменаЦветТекстаПоясняющий);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДействияПриПолученииБезСоответствияВИБ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДействияПриПолучении.ПроцентСоответствия");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 40;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
#КонецОбласти

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	КартинкаИспользовавшийсяВариант = БиблиотекаКартинок.ПерейтиВперед;
	КартинкаНовыйВариант            = БиблиотекаКартинок.ПолеВводаОткрыть;
	
	ВариантОтображенияНастройки = "УстанавливатьСоответствия";
	
	УстановитьРекомендацииПоНастройке();
	
	УправлениеСтраницамиРекомендаций(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры(Параметры, Отказ)
	
	Если Не ЗначениеЗаполнено(Параметры.УзелПланаОбмена) Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	УзелПланаОбмена = Параметры.УзелПланаОбмена; 
	
	Если Параметры.ТребующиеПодтверждения Тогда
		ОтборТребуетсяПодтверждение          = 1;
		НеЗагружатьНастройкиОтбораИзНастроек = Истина;
	КонецЕсли;
	
	ЗаполнитьДанныеФормыДляПланаОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыДляПланаОбмена()
	
	Результат = РегистрыСведений.ДействияПриПолученииДанныхОбмена.НастройкиПолученияОбъектовМетаданных(УзелПланаОбмена);
	
	Если Результат.Успешно Тогда
		
		Для Каждого СтрокаНастроек Из Результат.НастройкиПолучения Цикл
			
			НоваяСтрока = ДействияПриПолучении.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастроек);
			
			НоваяСтрока.ПолноеИмяМетаданных            = СтрокаНастроек.ПолноеИмя;
			НоваяСтрока.ИндексКартинкиОбъектМетаданных = ИндексыКартинокТиповОбъектовМетаданных(СтрокаНастроек.ИмяТипаМетаданных);
			НоваяСтрока.НаличиеКомментария             = ЗначениеЗаполнено(СтрокаНастроек.Комментарий);
			
		КонецЦикла;
		
		ДействияПриПолучении.Сортировать("ИндексКартинкиОбъектМетаданных Возр, ПредставлениеОбъектаМетаданных Возр");

	Иначе
		
		ДействияПриПолучении.Очистить();
		Элементы.ДекорацияОшибкаТекст.Заголовок          = Результат.ТекстОшибки;
		Элементы.СтраницыНастройкаОшибка.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Возврат;
		
	КонецЕсли;
	
	СтрокиТипы = Новый Соответствие;
	
	Для Каждого СтрокаДействия Из ДействияПриПолучении Цикл
		
		ИдентификаторСтрокиТипа = СтрокиТипы.Получить(СтрокаДействия.ИмяТипаМетаданных);
		
		Если ИдентификаторСтрокиТипа = Неопределено Тогда
			
			НоваяСтрокаОтборПоТипам = ОтборПоТипам.Добавить();
			НоваяСтрокаОтборПоТипам.Выбран                      = Истина;
			НоваяСтрокаОтборПоТипам.ТипМетаданных               = СтрокаДействия.ИмяТипаМетаданных;
			НоваяСтрокаОтборПоТипам.ПредставлениеТипаМетаданных = СтрокаДействия.ПредставлениеТипаМетаданных;
			НоваяСтрокаОтборПоТипам.Количество                  = 1;
			НоваяСтрокаОтборПоТипам.ИндексКартинки              = ИндексыКартинокТиповОбъектовМетаданных(НоваяСтрокаОтборПоТипам.ТипМетаданных);
			
			СтрокиТипы.Вставить(НоваяСтрокаОтборПоТипам.ТипМетаданных, НоваяСтрокаОтборПоТипам.ПолучитьИдентификатор())
			
		Иначе
			
			СтрокаТаблицыОтборПоТипам = ОтборПоТипам.НайтиПоИдентификатору(ИдентификаторСтрокиТипа);
			СтрокаТаблицыОтборПоТипам.Количество = СтрокаТаблицыОтборПоТипам.Количество + 1;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого СтрокаОтбор Из ОтборПоТипам Цикл
		
		СтрокаОтбор.Представление = СтрШаблон("%1 (%2)", СтрокаОтбор.ПредставлениеТипаМетаданных, СтрокаОтбор.Количество);
		
	КонецЦикла;
	
	Элементы.ОтборПоТипам.ВысотаВСтрокахТаблицы = ОтборПоТипам.Количество() + 1; 
	
	ЗаполнитьПроцентыСоответствия();
	
	УстановитьОтборыВСписке(ЭтотОбъект);
	
	ОпределитьДоступностьКомандыПодтверждениеЗагрузки(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ШаблонЗапросаПоПроцентамСоответствия()
	
	Возврат "
	|ВЫБРАТЬ
	|	&ИдентификаторСтрокиТаблицы КАК ИдентификаторСтроки,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка ЕСТЬ NULL
	|				ТОГДА NULL
	|			ИНАЧЕ ТаблицаДанных.Ссылка
	|		КОНЕЦ) КАК КоличествоСоответствующих,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаДанных.Ссылка) КАК КоличествоОбъектов
	|ИЗ
	|	&ИмяТаблицы КАК ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|		ПО ТаблицаДанных.Ссылка = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	|		И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПроцентыСоответствия()

	Если ДействияПриПолучении.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	НужноОбъединение = Ложь;
	
	Для Каждого СтрокаТаблицы Из ДействияПриПолучении Цикл
		
		Если СтрНайти(СтрокаТаблицы.ИмяТипаМетаданных, "Регистры") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстПодзапроса = ШаблонЗапросаПоПроцентамСоответствия();
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&ИдентификаторСтрокиТаблицы", Строка(СтрокаТаблицы.ПолучитьИдентификатор()));
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&ИмяТаблицы", Строка(СтрокаТаблицы.ПолноеИмяМетаданных));
		
		Если НужноОбъединение Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + ТекстПодзапроса;
		
		НужноОбъединение = Истина;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелПланаОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ДействияПриПолучении.НайтиПоИдентификатору(Выборка.ИдентификаторСтроки);
		
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.КоличествоОбъектов        = Выборка.КоличествоОбъектов;
		СтрокаТаблицы.КоличествоСоответствующих = Выборка.КоличествоСоответствующих;
		
		КоличествоСоответствующих = ?(Выборка.КоличествоСоответствующих = NULL, 0, Выборка.КоличествоСоответствующих);
		
		Если Выборка.КоличествоОбъектов > 0 Тогда
			СтрокаТаблицы.БезСоответствияВИБ = СтрШаблон(НСтр("ru = '%1 из %2'"), Выборка.КоличествоОбъектов - КоличествоСоответствующих, Выборка.КоличествоОбъектов);
		КонецЕсли;
		
		СтрокаТаблицы.ПроцентСоответствия = 
			?(СтрокаТаблицы.КоличествоОбъектов = 0,
			                                     0,
			                                     Окр(СтрокаТаблицы.КоличествоСоответствующих * 100/СтрокаТаблицы.КоличествоОбъектов, 1, РежимОкругления.Окр15как10));
		
		Если СтрокаТаблицы.КоличествоСоответствующих < СтрокаТаблицы.КоличествоОбъектов Тогда
			
			СтрокаТаблицы.ПроцентСоответствия = Мин(СтрокаТаблицы.ПроцентСоответствия, 99.9);
			
		КонецЕсли;
		
		Если СтрокаТаблицы.ПроцентСоответствия = 0 Тогда
			
			СтрокаТаблицы.ПроцентСоответствияОтбор = "Процент0";
			
		ИначеЕсли СтрокаТаблицы.ПроцентСоответствия = 100 Тогда 
			
			СтрокаТаблицы.ПроцентСоответствияОтбор = "Процент100";
			
		Иначе
			
			СтрокаТаблицы.ПроцентСоответствияОтбор = "ПроцентДо100";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьИзменений

&НаСервереБезКонтекста
Процедура ОбновитьЗаписиНаСервере(ОбновляемыеДействия)
	
	Если ТипЗнч(ОбновляемыеДействия) = Тип("Структура") Тогда
		
		РегистрыСведений.ДействияПриПолученииДанныхОбмена.ИзменитьЗаписьРегистра(ОбновляемыеДействия);
		
	Иначе
		
		Для каждого Действие Из ОбновляемыеДействия Цикл
			
			ОбновитьЗаписиНаСервере(Действие);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыйСтруктураДействий(УзелПланаОбмена = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("УзелПланаОбмена",                  УзелПланаОбмена);
	Результат.Вставить("ОбъектМетаданных",                 Неопределено);
	Результат.Вставить("Загружать",                        Ложь);
	Результат.Вставить("УстанавливатьСоответствия",        Неопределено);
	Результат.Вставить("КакЗагружать",                     Неопределено);
	Результат.Вставить("ЗначенияУстановленыАвтоматически", Ложь);
	Результат.Вставить("Комментарий",                      Неопределено);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНастройкиПолученияВТаблице()
	
	ТекущиеДанные = Элементы.ДействияПриПолучении.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДействий = НовыйСтруктураДействий(УзелПланаОбмена);
	
	Если ТекущиеДанные.ЗначенияУстановленыАвтоматически Тогда
		ТекущиеДанные.ЗначенияУстановленыАвтоматически = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураДействий, ТекущиеДанные);
	
	ОбновитьЗаписиНаСервере(СтруктураДействий);
	Оповестить("Запись_ДействияПриПолученииДанныхОбмена");
	
	ОпределитьДоступностьКомандыПодтверждениеЗагрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ГрупповоеИзменение

&НаКлиенте
Процедура ОткрытьФормуГрупповогоИзменения()

	ОповещениеОРезультатеВыбора = Новый ОписаниеОповещения("ГрупповоеИзменениеПослеЗакрытия", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.ДействияПриПолученииДанныхОбмена.Форма.ГрупповоеИзменение", , ЭтотОбъект,
	             ,,, ОповещениеОРезультатеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВариантаГрупповогоИзмененияИзМеню(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = - 1 Тогда
		
		ОткрытьФормуГрупповогоИзменения();
		
	Иначе
		
		СтрокаВарианты = НастройкиГрупповогоИзменения.НайтиПоИдентификатору(Результат.Значение);
		
		Если СтрокаВарианты <> Неопределено Тогда
			
			ИзменитьНастройкиПоРезультатамВыбораПользователя(СтрокаВарианты);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеИзменениеПослеЗакрытия(Результат, ДополнительныеПараметры)  Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПреобразоватьРезультатВыбораГрупповогоИзменения(Результат);
		
		ДобавитьДанныеВИсториюГрупповогоИзменения(Результат);
		
		ИзменитьНастройкиПоРезультатамВыбораПользователя(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеВИсториюГрупповогоИзменения(ДанныеВыбора)
	
	МаксимальноеЗначениеСтрокИстории = 5;
	
	НайденныеСтроки = НастройкиГрупповогоИзменения.НайтиСтроки(ДанныеВыбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		НоваяСтрока = НастройкиГрупповогоИзменения.Вставить(0);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеВыбора);
		
	КонецЕсли;
	
	Если НастройкиГрупповогоИзменения.Количество() = МаксимальноеЗначениеСтрокИстории + 1 Тогда
		
		НастройкиГрупповогоИзменения.Удалить(МаксимальноеЗначениеСтрокИстории);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьРезультатВыбораГрупповогоИзменения(ДанныеВыбора)

	Если Не ДанныеВыбора.ИзменитьНастройкиЗагрузки Тогда 
		
		ДанныеВыбора.Загружать = Ложь;
		ДанныеВыбора.КакЗагружать              = ПредопределенноеЗначение("Перечисление.ВариантыДействийПриПолученииДанныхОбмена.ПустаяСсылка");
		ДанныеВыбора.УстанавливатьСоответствия = ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.ПустаяСсылка");
		
	КонецЕсли;
	
	Если Не ДанныеВыбора.ИзменитьКомментарий Тогда
		
		ДанныеВыбора.Комментарий = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиПоРезультатамВыбораПользователя(ДанныеДляИзменения)
	
	СтрокиДействия = Новый Массив;
	
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ДействияПриПолучении.ВыделенныеСтроки Цикл
		
		СтрокаТаблицыДействий = ДействияПриПолучении.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		
		Если СтрокаТаблицыДействий <> Неопределено Тогда
			
			Действие = НовыйСтруктураДействий(УзелПланаОбмена);
			ЗаполнитьЗначенияСвойств(Действие, СтрокаТаблицыДействий);
			Если ДанныеДляИзменения.ИзменитьНастройкиЗагрузки Тогда
				ЗаполнитьЗначенияСвойств(Действие, ДанныеДляИзменения, "Загружать, КакЗагружать, УстанавливатьСоответствия");
				Действие.ЗначенияУстановленыАвтоматически = Ложь;
			КонецЕсли;
			Если ДанныеДляИзменения.ИзменитьКомментарий Тогда
				ЗаполнитьЗначенияСвойств(Действие, ДанныеДляИзменения, "Комментарий");
			КонецЕсли;
			СтрокиДействия.Добавить(Действие);
			
		КонецЕсли;
		
		ОбновитьСтрокуДействияПриПолученииНаКлиенте(ИдентификаторВыделеннойСтроки, Действие);
		
	КонецЦикла;
	
	ОбновитьЗаписиНаСервере(СтрокиДействия);
	Оповестить("Запись_ДействияПриПолученииДанныхОбмена");
	ОпределитьДоступностьКомандыПодтверждениеЗагрузки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция РанееИспользовавшиесяВариантыГрупповогоИзменения()
	
	ИспользовавшиесяВарианты.Очистить();
	
	МаксимальнаяШиринаВарианта = 85;
	
	Для Каждого СтрокаНастройкаГрупповогоИзменения Из НастройкиГрупповогоИзменения Цикл
		
		СтрокиВарианта = Новый Массив;
		
		Если СтрокаНастройкаГрупповогоИзменения.ИзменитьКомментарий Тогда
			
			ТекстКомментарияДляВывода = ""; 
			
			Если Не ПустаяСтрока(СтрокаНастройкаГрупповогоИзменения.Комментарий) Тогда
				
				СтрокиКомментария = СтрРазделить(СтрокаНастройкаГрупповогоИзменения.Комментарий," ", Ложь);
				
				Для Каждого ЧастьКомментария Из СтрокиКомментария Цикл
					
					ДлинаЧастиКомментария = СтрДлина(ЧастьКомментария);
					
					Если СтрДлина(ТекстКомментарияДляВывода) + ДлинаЧастиКомментария < 25 Тогда
						
						ТекстКомментарияДляВывода =  ТекстКомментарияДляВывода + " " + ЧастьКомментария;
						
					Иначе
						
						ТекстКомментарияДляВывода =  ТекстКомментарияДляВывода + "...";
						Прервать;
						
					КонецЕсли;
					
					
				КонецЦикла;
				
			КонецЕсли;
			
			СтрокаКомментарий = СтрШаблон(НСтр("ru = 'комментарий - ""%1""'"), ТекстКомментарияДляВывода);
			СтрокиВарианта.Добавить(СтрокаКомментарий);
			
		КонецЕсли;
		
		Если СтрокаНастройкаГрупповогоИзменения.ИзменитьНастройкиЗагрузки Тогда
		
			Если Не СтрокаНастройкаГрупповогоИзменения.Загружать Тогда
				
				СтрокиВарианта.Добавить(НСтр("ru = 'Не загружать'"));
				
			Иначе
				
				СтрокаУстанавливатьСоответствия = СтрШаблон(НСтр("ru = 'уст. соотв. - ""%1""'"), СтрокаНастройкаГрупповогоИзменения.УстанавливатьСоответствия);
				СтрокиВарианта.Добавить(СтрокаУстанавливатьСоответствия); 
				
				СтрокаКакЗагружать = СтрШаблон(НСтр("ru = 'как загружать - ""%1""'"), СтрокаНастройкаГрупповогоИзменения.КакЗагружать);
				СтрокиВарианта.Добавить(СтрокаКакЗагружать); 
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстВарианта = ПредставлениеСпискаМаксимальнойДлины("значение", СтрокиВарианта, МаксимальнаяШиринаВарианта);
		
		ИспользовавшиесяВарианты.Добавить(СтрокаНастройкаГрупповогоИзменения.ПолучитьИдентификатор(), ТекстВарианта,,КартинкаИспользовавшийсяВариант);
		
	КонецЦикла;
	
	Возврат ИспользовавшиесяВарианты;

КонецФункции

&НаКлиенте
Процедура ДобавитьВариантГрупповогоИзмененияНовый(ИспользовавшиесяВарианты)
	
	ТекстВарианта = НСтр("ru = 'Выбрать другой вариант изменения выделенных строк...'");
	ИспользовавшиесяВарианты.Добавить(- 1, ТекстВарианта,, КартинкаНовыйВариант);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
